Repository: KarinaVeremeyeva/Mbicycle.Veremeyeva.MusicCatalog
Catalog: src/MusicCatalog-AngularClient/src/i18n/messages.*.xlf
Languages: ru

# albums-header
source: Albums list
ru: Список альбомов

# albums-description
source: List of all albums
ru: Список всех альбомов

source: Create album
ru: Создать альбом

# th-album-name
source: Name
ru: Название

# th-release-date
source: Release date
ru: Дата релиза

# btn-edit-album
source: Edit
ru: Изменить

# btn-delete-album
source: Delete
ru: Удалить

# genres-header
source: Genres list
ru: Список жанров

# genres-description
source: List of all genres
ru: Список всех жанров

source: Create genre
ru: Создать жанр

# th-genre-name
source: Name
ru: Название

# btn-edit-genre
source: Edit
ru: Изменить

# btn-delete-genre
source: Delete
ru: Удалить

# list-name
source: Songs list
ru: Список песен

# description
source: List of all songs
ru: Список всех песен

source: Create song
ru: Создать песню

source: Search by name:
ru: Поиск по названию:

# placeholder
source: Enter song name to search
ru: Введите название песни для поиска

# song-name
source: Name
ru: Название

# album-name
source: Album
ru: Альбом

# genre-name
source: Genre
ru: Жанр

# performer-name
source: Performer
ru: Исполнитель

# btn-edit
source: Edit
ru: Изменить

# btn-delete
source: Delete
ru: Удалить

source: Sign Up
ru: Регистрация

source: Login
ru: Войти

# sign-in-as
source: Sign in as {{ currentUser.email }}
ru: Вы вошли как {{ currentUser.email }}

source: Users
ru: Пользователи

source: LogOut
ru: Выйти

source: Home
ru: Главная

source: Albums
ru: Альбомы

source: Genres
ru: Жанры

source: Performers
ru: Исполнители

# login-header
source: Login user
ru: Войти

# login-email
source: Email
ru: Почта

# login-email-required
source: Email is required
ru: Почта не указана

# login-password
source: Password
ru: Пароль

# login-password-required
source: Password is required
ru: Пароль не указан

# login-password-length
source: Password must be at least 8 characters
ru: Пароль должке состоять из минимум 8 символов

source: Remember me
ru: Запомнить меня

# btn-login
source: <span *ngIf="loading" class="spinner-border spinner-border-sm mr-1"></span> Login
ru: <span *ngIf="loading" class="spinner-border spinner-border-sm mr-1"></span> Войти

# performers-header
source: Performers list
ru: Список исполнителей

# performers-description
source: List of all performers
ru: Список всех исполнителей

source: Create performer
ru: Создать исполнителя

# th-performer-name
source: Name
ru: Имя

# btn-edit-performer
source: Edit
ru: Изменить

# btn-delete-performer
source: Delete
ru: Удалить

# register-header
source: Sign up user
ru: Создать нового пользователя

# register-email
source: Email
ru: Почта

# register-email-required
source: Email is required
ru: Почта не указана

# register-password
source: Password
ru: Пароль

# register-password-required
source: Password is required
ru: Пароль не указан

# register-password-length
source: Password must be at least 8 characters
ru: Пароль должке состоять из минимум 8 символов

# register-role
source: Role
ru: Роль

# register-role-required
source: Role is required
ru: Роль не указана

# btn-register
source: <span *ngIf="loading" class="spinner-border spinner-border-sm mr-1"></span> Sign Up
ru: <span *ngIf="loading" class="spinner-border spinner-border-sm mr-1"></span> Регистрация

# users-header
source: Users list
ru: Список пользователей

# users-description
source: List of all registered users
ru: Список всех зарегистрированных пользователей

# th-user-email
source: Email
ru: Почта

# th-user-role
source: Role
ru: Роль

# btn-edit-user
source: Edit
ru: Изменить

# btn-delete-user
source: Delete
ru: Удалить

# add-album-header
source: Create album
ru: Создать альбом

source: Name
ru: Название

source: Name is required
ru: Название не указано

source: Name must be at least 3 characters
ru: Название должно состоять из не менее 3 символов

source: Release date
ru: Дата релиза

source: Release date is required
ru: Дата релиза не указана

source: Create album
ru: Создать альбом

# btn-back-to-list
source: Back to list
ru: Вернуться к списку

# edit-album-header
source: Edit album
ru: Изменить альбом

source: Update album
ru: Изменить альбом

source: Album
ru: Альбом

source: Select album
ru: Выберите альбом

source: Album is required
ru: Альбом не указан

source: Genre
ru: Жанр

source: Select genre
ru: Выберите жанр

source: Genre is required
ru: Жанр не указан

source: Performer
ru: Исполнитель

source: Select performer
ru: Выберите исполнителя

source: Performer is required
ru: Исполнитель не указан

source: Edit song
ru: Изменить песню

source: Update song
ru: Изменить песню

# add-genre-header
source: Create genre
ru: Создать жанр

# genre-name-lbl
source: Name
ru: Название

# genre-name-required
source: Name is required
ru: Жанр не указан

source: Create genre
ru: Создать жанр

# edit-genre-header
source: Edit genre
ru: Изменить жанр

source: Update genre
ru: Изменить жанр

# modal-title
source: Confirm
ru: Подтверждение

# modal-no
source: No
ru: Нет

# modal-yes
source: Yes
ru: Да

# edit-user-header
source: Edit user
ru: Изменить пользователя

# user-email-lbl
source: Email
ru: Почта

# email-required
source: Email is required
ru: Почта не указана

# email-format
source: Email is invalid
ru: Почта не действительна

# user-role-lbl
source: Role
ru: Роль

source: Update user
ru: Изменить пользователя

# add-performer-header
source: Create performer
ru: Создать исполнителя

# performer-name-lbl
source: Name
ru: Имя

# performer-name-required
source: Name is required
ru: Имя не указано

# performer-length
source: Name must be at least 3 characters
ru: Имя должно состоять из минимум 3 символов

source: Create performer
ru: Создать исполнителя

# edit-performer-header
source: Edit performer
ru: Изменить исполнителя

source: Update performer
ru: Изменить исполнителя

source: Are you sure you want to delete this album?
ru: Вы уверены, что хотите удалить этот альбом?

source: Are you sure you want to delete this genre?
ru: Вы уверены, что хотите удалить этот жанр?

source: Are you sure you want to delete this performer?
ru: Вы уверены, что хотите удалить этого испонителя?

source: Are you sure you want to delete this song?
ru: Вы уверены, что хотите удалить эту песню?

source: Are you sure you want to delete this user?
ru: Вы уверены, что хотите удалить этого пользователя?
